#+TITLE: Verteilte Systeme \linebreak \small...für C++ Programmierer \hfill Threads: Performance & Speicher
#+AUTHOR: Dr. Günter Kolousek
#+DATE: \copy Dr. Günter Kolousek \hspace{12ex} [[http://creativecommons.org/licenses/by-nc-nd/4.0/][Creative Commons Namensnennung - Nicht kommerziell - Keine Bearbeitungen 4.0 International Lizenz]]

#+OPTIONS: H:1 toc:nil
#+LATEX_CLASS: beamer
#+LATEX_CLASS_OPTIONS: [presentation]
#+BEAMER_THEME: Execushares
#+COLUMNS: %45ITEM %10BEAMER_ENV(Env) %10BEAMER_ACT(Act) %4BEAMER_COL(Col) %8BEAMER_OPT(Opt)

#+LATEX_HEADER:\usepackage{pgfpages}
# +LATEX_HEADER:\pgfpagesuselayout{2 on 1}[a4paper,border shrink=5mm]u
# +LATEX: \mode<handout>{\setbeamercolor{background canvas}{bg=black!5}}
#+LATEX_HEADER:\usepackage{xspace}
#+LATEX: \newcommand{\cpp}{C++\xspace}

* Optimale # an parallelen Threads?
#+header: :exports both :results output :tangle src/hwthreads.cpp :flags -std=c++1y -lpthread :main no
#+begin_src C++
#include <iostream>  // hwthreads.cpp
#include <thread>
using namespace std;
int main() {
    int hw_threads{thread::hardware_concurrency()};
    if (hw_threads) {
        cout << hw_threads << endl;
    } else {
        cout << "no info available" << endl; }}
#+end_src

#+RESULTS:
: 8

... Intel i7-8550U: 4 Kerne mit je 2 Threads

